alice_in_wonderland = '''"Would you tell me, please, which way I ought to go from here?"
"That depends a good deal on where you want to get to," said the Cat.
"I don\'t much care where ——" said Alice.
"Then it doesn\'t matter which way you go," said the Cat.
—- "So long as I get somewhere," Alice added as an explanation.
"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'''
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

print (alice_in_wonderland)
print ()

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
#task_04

black_sea_area = 436402
azov_sea_area = 37800

print (f'Площа Чорного моря становить {black_sea_area} км2, а площа Азовського моря - {azov_sea_area} км2. \n'
       f'Загальна площа Чорного та Азовського морів, які омивають терени вільної, нзалежної та суверенної України '
       f'становить {black_sea_area + azov_sea_area} км2')
print ()
# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
#task_05

storage_number = 3
storage_all = 375291
storage_1 = storage_all - 222950
storage_3 = storage_all - 250449
storage_2 = storage_all - storage_1 - storage_3

print (f'Мережа супермаркетів має {storage_number} склади, де всього розміщено {storage_all} товар. \n'
       f'На першому та другому складах перебуває {storage_1 + storage_2} товарів.\n'
       f'На другому та третьому – {storage_2 + storage_3} товарів.\n'
       f'В такому випадку на першому складі знаходиться {storage_1} товар, на другому {storage_2} товарів,\n'
       f'а на третьому - {storage_3} товарів')
print ()

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
#task_06

part_price = 1179
date = 18
full_price = part_price * date

print (f'За умови придбання товару з послугою "Оплата частинами" терміном на {date} місяців та \n'
       f'щомісячним платежем у розмірі {part_price} грн загальна вартість комп\'ютеру становитиме {full_price} грн.\n'
       f'Рекомендуємо батькам вимагати з сина мінімум дві третини від суми щомісячного платежу, тобто не менше '
       f'{int(part_price*0.66666666)} грн/міс, щоб він не в ігри грав, а хай йде заробляє.')
print ()
# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
#task_07

res_a = 8019 % 8
res_b = 9907 % 9
res_c = 2789 % 5
res_d = 7248 % 6
res_e = 7128 % 5
res_f = 19224 % 5


print (f'Result a = {res_a};\n'
       f'Result b = {res_b};\n'
       f'Result c = {res_c};\n'
       f'Result d = {res_d};\n'
       f'Result e = {res_e};\n'
       f'Result f = {res_f};')
print ()
# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
#task_08

big_pizza_cost = 274
medium_pizza_cost = 218
juice_cost = 35
cake_cost = 350
water_cost = 21
big_pizza_amount = 4
medium_pizza_amount = 2
juice_amount = 4
cake_amount = 1
water_amount = 3

print (f'Нам відомо, що Іринка має багато друзів і хоче замовити {big_pizza_amount} великих піци \n'
       f'вартістю {big_pizza_cost} грн/шт, {medium_pizza_amount} середні піци по {medium_pizza_cost} грн/шт, \n'
       f'{juice_amount} соки по {juice_cost} грн/шт, {cake_amount} торт за {cake_cost} грн/шт, \n'
       f'а ще й {water_amount} пляшки води по {water_cost} грн/шт.\n'
       f'За таких умов Іринці доведеться загально витрати {(big_pizza_cost*big_pizza_amount) +
                                                           (medium_pizza_cost*medium_pizza_amount) +
                                                           (juice_cost*juice_amount) + (cake_amount*cake_cost) +
                                                           (water_cost*water_amount)} грн.\n'
       f'Здається наша Іринка транжира і подружка вже відомого нам Михайла.')
print()
# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
#task_09

total_photo = 232
one_page = 8
print (f'Ігор має {total_photo} фотографій, а на одну сторінку альбому вміщується {one_page} фотокарток. \n'
       f'За таких умов Ігору знодобиться {total_photo//one_page} сторінок альбому. \n'
       f'Також зауважимо, що в такому випадку залишиться {total_photo%one_page} фотографій, які не помістяться у альбом.')
if total_photo%one_page == 0:
       print ('Тобто всі наявні фотографії заповнять сторінки повністю.')
else:
       print('Тобто всі наявні фотографії не заповнять сторінки повністю.')
print()
# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
#task_10
total_distance = 1600
distance_100 = 100
fuel_consumption = 9
tank_capacity = 48

print (f'При умомі відстані подорожі у {total_distance} км та витрати пального у {fuel_consumption} л на \n'
       f'{distance_100} км родині знадобиться {(total_distance/distance_100)*fuel_consumption} л бензину.\n'
       f'Також за умови, що родині пощастить і АЗС будуть траплятися через кожні '
       f'{round((tank_capacity/fuel_consumption)*distance_100, 2)} км, \n'
       f'то їм необхідно буде відвідати заправні станції не менше '
       f'{int(((total_distance/distance_100)*fuel_consumption)/tank_capacity)} разів.\n'
       f'Але в таку удачу віриться важко, та й заправні станції можуть траплятися різні, з різною якістю палива. \n'
       f'Тому рекомендуємо родині дбати про заправку через {((tank_capacity//fuel_consumption)*distance_100) * 0.75} км, \n'
       f'після попередньої аби не застрягти посеред траси. \n'
       f'Також гарним рішенням буде взяти з собою каністру з паливом мінімум на {fuel_consumption} л, \n'
       f'аби мати запас хоча б {distance_100} км ходу.')

